data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.global: Reading...
data.aws_secretsmanager_secret.ecs: Reading...
module.cloudwatch_alerts.module.notify_slack.data.aws_caller_identity.current: Reading...
module.ecs_akhq.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/akhq]
module.ecs_order_product_enrichment.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/order-product-enrichment]
module.ecs_order_management.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/order-management]
module.ecs_xperience.data.aws_route53_zone.this[0]: Reading...
module.ecs_auth.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/auth]
module.ecs_emailer.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/emailer]
data.terraform_remote_state.global: Read complete after 1s
module.ecs_email_management.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/email-management]
module.cloudwatch_alerts.module.notify_slack.data.aws_caller_identity.current: Read complete after 1s [id=547131802207]
module.ecs_auth.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/auth]
data.terraform_remote_state.infra: Read complete after 2s
module.ecs_access_agreement.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/access-agreement]
data.aws_secretsmanager_secret.ecs: Read complete after 1s [id=arn:aws:secretsmanager:us-east-1:547131802207:secret:ecs-zEbq0X]
module.ecs_order_product_enrichment.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/order-product-enrichment]
module.ecs_platypus_driver.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/platypus-driver]
module.ecs_admin.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/admin]
module.ecs_platypus_driver.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/platypus-driver]
module.ecs_admin.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/admin]
module.ecs_access_agreement.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/access-agreement]
module.ecs_demo_board.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/demo-board]
module.ecs_emailer.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/emailer]
module.ecs_order_management.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/order-management]
data.aws_secretsmanager_secret_version.ecs: Reading...
module.cloudwatch_alerts.module.notify_slack.data.aws_region.current: Reading...
module.ecs_xperience.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/xperience]
module.cloudwatch_alerts.module.notify_slack.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs_admin.data.aws_route53_zone.this[0]: Reading...
module.cloudwatch_alerts.module.notify_slack.data.aws_partition.current: Reading...
module.cloudwatch_alerts.module.notify_slack.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_xperience.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/xperience]
data.aws_secretsmanager_secret_version.ecs: Read complete after 0s [id=ecs|AWSCURRENT]
module.ecs_middleware.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/middleware]
module.ecs_email_management.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/email-management]
aws_secretsmanager_secret.db_master_password_base64: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:547131802207:secret:db_master_password_base64-lI4s4K]
module.ecs_akhq.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:cluster/akhq]
module.ecs_middleware.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/middleware]
module.ecs_demo_board.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/demo-board]
data.aws_secretsmanager_secret.db_master_password: Reading...
module.ecs_order_product_enrichment.data.aws_subnets.private[0]: Reading...
module.ecs_access_agreement.data.aws_subnets.public[0]: Reading...
module.ecs_access_agreement.data.aws_subnets.private[0]: Reading...
module.ecs_order_product_enrichment.data.aws_subnets.public[0]: Reading...
module.ecs_order_management.data.aws_subnets.public[0]: Reading...
module.ecs_order_management.data.aws_subnets.private[0]: Reading...
module.ecs_admin.data.aws_subnets.private[0]: Reading...
data.aws_secretsmanager_secret.db_master_password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:547131802207:secret:rds!cluster-9976bbaa-ec08-4b56-be82-579b9684bf53-HWBxpG]
module.ecs_xperience.data.aws_subnets.public[0]: Reading...
module.ecs_xperience.data.aws_route53_zone.this[0]: Read complete after 2s [id=Z06873321CNHOG4QDC506]
module.ecs_akhq.data.aws_subnets.public[0]: Reading...
module.ecs_admin.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z06873321CNHOG4QDC506]
module.ecs_access_agreement.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_admin.data.aws_subnets.public[0]: Reading...
module.ecs_xperience.data.aws_subnets.private[0]: Reading...
module.ecs_xperience.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_akhq.data.aws_subnets.private[0]: Reading...
module.ecs_order_product_enrichment.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_admin.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_platypus_driver.data.aws_subnets.public[0]: Reading...
module.ecs_order_management.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_emailer.data.aws_subnets.private[0]: Reading...
module.ecs_emailer.data.aws_subnets.public[0]: Reading...
module.ecs_order_management.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_access_agreement.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_auth.data.aws_subnets.private[0]: Reading...
module.ecs_auth.data.aws_subnets.public[0]: Reading...
module.ecs_order_product_enrichment.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_middleware.data.aws_subnets.private[0]: Reading...
module.ecs_akhq.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_middleware.data.aws_subnets.public[0]: Reading...
module.ecs_xperience.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_admin.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_platypus_driver.data.aws_subnets.private[0]: Reading...
module.ecs_demo_board.data.aws_subnets.private[0]: Reading...
module.ecs_platypus_driver.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_emailer.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_emailer.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_akhq.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_demo_board.data.aws_subnets.public[0]: Reading...
module.ecs_access_agreement.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230719184841736800000011/a5fa9d2d055f78c0]
module.ecs_email_management.data.aws_subnets.private[0]: Reading...
module.ecs_email_management.data.aws_subnets.public[0]: Reading...
module.ecs_auth.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_middleware.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_middleware.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_order_product_enrichment.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230721152641069400000001/ad11c6296b6f1161]
module.ecs_auth.data.aws_subnets.public[0]: Read complete after 0s [id=us-east-1]
module.ecs_order_management.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230719184825657800000004/aea63d8a46c4f042]
module.ecs_admin.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230719184828463800000009/f0b6bd613ab56e76]
data.aws_secretsmanager_secret_version.db_master_password: Reading...
module.ecs_platypus_driver.data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
module.ecs_demo_board.data.aws_subnets.private[0]: Read complete after 1s [id=us-east-1]
module.ecs_email_management.data.aws_subnets.private[0]: Read complete after 1s [id=us-east-1]
module.ecs_xperience.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230719184825642400000002/060a142d6a1254f1]
module.ecs_demo_board.data.aws_subnets.public[0]: Read complete after 1s [id=us-east-1]
module.ecs_akhq.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-2023071918482929180000000a/7245dcbef491b429]
module.ecs_email_management.data.aws_subnets.public[0]: Read complete after 1s [id=us-east-1]
module.ecs_platypus_driver.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230720145807166200000001/1cc8acd71966081b]
module.ecs_emailer.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230719184825643200000003/0f3584e52bdd388b]
module.ecs_auth.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-2023071918483668310000000e/73ed304f6da50cbe]
data.aws_secretsmanager_secret_version.db_master_password: Read complete after 1s [id=arn:aws:secretsmanager:us-east-1:547131802207:secret:rds!cluster-9976bbaa-ec08-4b56-be82-579b9684bf53-HWBxpG|AWSCURRENT]
module.ecs_middleware.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230719184827287500000006/3e31e34c29c99041]
module.ecs_demo_board.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230720144919265900000001/78bb65eeaf4bd240]
module.ecs_email_management.module.alb__ecs.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:targetgroup/tf-20230719184827206500000005/1cfc954cd65fd908]
module.ecs_access_agreement.aws_ecs_task_definition.this[0]: Refreshing state... [id=access-agreement]
module.ecs_emailer.aws_ecs_task_definition.this[0]: Refreshing state... [id=emailer]
module.ecs_akhq.aws_ecs_task_definition.this[0]: Refreshing state... [id=akhq]
module.ecs_email_management.aws_ecs_task_definition.this[0]: Refreshing state... [id=email-management]
module.ecs_order_product_enrichment.aws_ecs_task_definition.this[0]: Refreshing state... [id=order-product-enrichment]
module.ecs_auth.aws_ecs_task_definition.this[0]: Refreshing state... [id=auth]
module.ecs_access_agreement.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/access-agreement/9104c02887a45678]
module.ecs_xperience.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/xperience/a6b3c1ee1dd61e12]
module.ecs_order_product_enrichment.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/order-product-enrichment/01e8307720d641ba]
module.ecs_order_management.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/order-management/23ea494838bf8c0a]
module.ecs_akhq.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/akhq/127a7f467d4967c5]
module.ecs_admin.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/admin/349bb7286b13af5e]
module.ecs_platypus_driver.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/platypus-driver/410e775a5862a9eb]
module.ecs_emailer.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/emailer/b9ed0e1134722282]
module.ecs_middleware.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/middleware/8dd43e2a852c1de4]
module.ecs_auth.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/auth/66e9f5efad0f2e17]
module.ecs_demo_board.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/demo-board/0161dc2391544e20]
aws_secretsmanager_secret_version.db_master_password_base64: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:547131802207:secret:db_master_password_base64-lI4s4K|38F23228-143A-4A0C-88A3-7C6B946397BA]
module.ecs_email_management.module.alb__ecs.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:loadbalancer/app/email-management/cb49d1a5c9cee507]
module.ecs_access_agreement.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/access-agreement/access-agreement]
module.ecs_order_product_enrichment.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/order-product-enrichment/order-product-enrichment]
module.ecs_emailer.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/emailer/emailer]
module.ecs_access_agreement.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/access-agreement/9104c02887a45678/0a09de6099440c3b]
module.ecs_auth.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/auth/auth]
module.ecs_akhq.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/akhq/akhq]
module.ecs_xperience.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/xperience/a6b3c1ee1dd61e12/27009dda60c4515c]
module.ecs_order_product_enrichment.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/order-product-enrichment/01e8307720d641ba/c80dd69cca0df045]
module.ecs_order_management.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/order-management/23ea494838bf8c0a/79259d8b952d3533]
module.ecs_demo_board.aws_ecs_task_definition.this[0]: Refreshing state... [id=demo-board]
module.ecs_order_management.aws_ecs_task_definition.this[0]: Refreshing state... [id=order-management]
module.ecs_platypus_driver.aws_ecs_task_definition.this[0]: Refreshing state... [id=platypus-driver]
module.ecs_admin.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/admin/349bb7286b13af5e/841f9f2367619fcc]
module.ecs_emailer.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/emailer/b9ed0e1134722282/3a394ebd83cdbb72]
module.ecs_email_management.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/email-management/email-management]
module.ecs_akhq.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/akhq/127a7f467d4967c5/0670b44148da13f3]
module.ecs_platypus_driver.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/platypus-driver/410e775a5862a9eb/b78d6a7224e29303]
module.ecs_auth.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/auth/66e9f5efad0f2e17/db8c2d7799eca13a]
module.ecs_xperience.aws_route53_record.this[0]: Refreshing state... [id=Z06873321CNHOG4QDC506_dxdigital_CNAME]
module.ecs_middleware.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/middleware/8dd43e2a852c1de4/ae45138c5a5ae4cb]
module.ecs_admin.aws_route53_record.this[0]: Refreshing state... [id=Z06873321CNHOG4QDC506_dxadmin_CNAME]
module.ecs_demo_board.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/demo-board/demo-board]
module.ecs_order_management.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/order-management/order-management]
module.ecs_platypus_driver.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/platypus-driver/platypus-driver]
module.ecs_email_management.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/email-management/cb49d1a5c9cee507/e7364cc296a0a434]
module.ecs_demo_board.module.alb__ecs.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:547131802207:listener/app/demo-board/0161dc2391544e20/abe50fa6acac5379]
module.ecs_middleware.aws_ecs_task_definition.this[0]: Refreshing state... [id=middleware]
module.ecs_admin.aws_ecs_task_definition.this[0]: Refreshing state... [id=admin]
module.ecs_xperience.aws_ecs_task_definition.this[0]: Refreshing state... [id=xperience]
module.ecs_admin.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/admin/admin]
module.ecs_middleware.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/middleware/middleware]
module.ecs_xperience.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:547131802207:service/xperience/xperience]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_secretsmanager_secret_version.slack_webhook_current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "slack_webhook_current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_cloudwatch_dashboard.wavelo_status will be created
  + resource "aws_cloudwatch_dashboard" "wavelo_status" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 13
                      + properties = {
                          + legend   = {
                              + position = "right"
                            }
                          + liveData = false
                          + metrics  = [
                              + [
                                  + "AWS/ECS",
                                  + "CPUUtilization",
                                  + "ClusterName",
                                  + "akhq",
                                  + "ServiceName",
                                  + "akhq",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "platypus-driver",
                                  + ".",
                                  + "platypus-driver",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "address-search",
                                  + ".",
                                  + "address-search",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "deal-creator",
                                  + ".",
                                  + "deal-creator",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "sales-crm-lead-cdc",
                                  + ".",
                                  + "sales-crm-lead-cdc",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "order-product-enrichment",
                                  + ".",
                                  + "order-product-enrichment",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "email-management",
                                  + ".",
                                  + "email-management",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "admin",
                                  + ".",
                                  + "admin",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "kafka-connect-configs-stg",
                                  + ".",
                                  + "kafka-connect-configs-stg",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "demo-board",
                                  + ".",
                                  + "demo-board",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "access-agreement",
                                  + ".",
                                  + "access-agreement",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "xperience",
                                  + ".",
                                  + "xperience",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "address-intelligence",
                                  + ".",
                                  + "address-intelligence",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "middleware",
                                  + ".",
                                  + "middleware",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "kafka-connect-stg",
                                  + ".",
                                  + "kafka-connect-stg",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "enterprise-lead-creator",
                                  + ".",
                                  + "enterprise-lead-creator",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "sales-crm-cdc",
                                  + ".",
                                  + "sales-crm-cdc",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "auth",
                                  + ".",
                                  + "auth",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "emailer",
                                  + ".",
                                  + "emailer",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "marketing-email-subscriptions",
                                  + ".",
                                  + "marketing-email-subscriptions",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "deal-closer",
                                  + ".",
                                  + "deal-closer",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "poc-xperience-auth",
                                  + ".",
                                  + "poc-xperience-auth",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "ksqldb-stg",
                                  + ".",
                                  + "ksqldb-stg",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "order-management",
                                  + ".",
                                  + "order-management",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                            ]
                          + region   = "us-east-1"
                          + timezone = "UTC"
                          + title    = "CPUUtilization: Average"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 13
                      + properties = {
                          + legend   = {
                              + position = "right"
                            }
                          + liveData = false
                          + metrics  = [
                              + [
                                  + "AWS/ECS",
                                  + "MemoryUtilization",
                                  + "ClusterName",
                                  + "akhq",
                                  + "ServiceName",
                                  + "akhq",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "platypus-driver",
                                  + ".",
                                  + "platypus-driver",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "address-search",
                                  + ".",
                                  + "address-search",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "deal-creator",
                                  + ".",
                                  + "deal-creator",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "sales-crm-lead-cdc",
                                  + ".",
                                  + "sales-crm-lead-cdc",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "order-product-enrichment",
                                  + ".",
                                  + "order-product-enrichment",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "email-management",
                                  + ".",
                                  + "email-management",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "admin",
                                  + ".",
                                  + "admin",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "kafka-connect-configs-stg",
                                  + ".",
                                  + "kafka-connect-configs-stg",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "demo-board",
                                  + ".",
                                  + "demo-board",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "access-agreement",
                                  + ".",
                                  + "access-agreement",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "xperience",
                                  + ".",
                                  + "xperience",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "address-intelligence",
                                  + ".",
                                  + "address-intelligence",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "middleware",
                                  + ".",
                                  + "middleware",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "kafka-connect-stg",
                                  + ".",
                                  + "kafka-connect-stg",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "enterprise-lead-creator",
                                  + ".",
                                  + "enterprise-lead-creator",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "sales-crm-cdc",
                                  + ".",
                                  + "sales-crm-cdc",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "auth",
                                  + ".",
                                  + "auth",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "emailer",
                                  + ".",
                                  + "emailer",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "marketing-email-subscriptions",
                                  + ".",
                                  + "marketing-email-subscriptions",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "deal-closer",
                                  + ".",
                                  + "deal-closer",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "poc-xperience-auth",
                                  + ".",
                                  + "poc-xperience-auth",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "ksqldb-stg",
                                  + ".",
                                  + "ksqldb-stg",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "order-management",
                                  + ".",
                                  + "order-management",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                            ]
                          + region   = "us-east-1"
                          + timezone = "UTC"
                          + title    = "MemoryUtilization: Average"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 0
                    },
                  + {
                      + height     = 24
                      + properties = {
                          + alarms = [
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:xperience - ECS RAM Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:xperience - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:auth - ECS RAM Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:emailer - High response time detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:marketing-email-subscriptions - 5xx Errors detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:sales-crm-lead-cdc - ECS CPU Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:email-management - High response time detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-management - ECS RAM Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:platypus-driver - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:sales-crm-lead-cdc - Target Group Health Check Critical",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:platypus-driver - 5xx Errors detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:marketing-email-subscriptions - Target Group Health Check Critical",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:middleware - 5xx Errors detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:middleware - High response time detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:marketing-email-subscriptions - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:emailer - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:sales-crm-cdc - ECS RAM Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:address-search - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:deal-closer - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:sales-crm-lead-cdc - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-management - ECS CPU Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:middleware - Target Group Health Check Critical",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-product-enrichment - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-management - Target Group Health Check Critical",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:enterprise-lead-creator - Target Group Health Check Critical",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:address-search - 5xx Errors detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:middleware - ECS RAM Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:deal-closer - 5xx Errors detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:enterprise-lead-creator - ECS CPU Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:email-management - ECS RAM Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:platypus-driver - ECS RAM Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:address-search - ECS CPU Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:auth - ECS CPU Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:email-management - 5xx Errors detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:xperience - High response time detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:address-intelligence - Target Group Health Check Critical",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-management - High response time detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:enterprise-lead-creator - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-product-enrichment - High response time detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:sales-crm-cdc - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:address-intelligence - ECS CPU Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:xperience - Target Group Health Check Critical",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-product-enrichment - ECS CPU Usage High",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:email-management - Target Group Health Check Critical",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-product-enrichment - 5xx Errors detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-management - Unhealthy Hosts in Target Group",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:address-intelligence - High response time detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:order-management - 5xx Errors detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:auth - High response time detected",
                              + "arn:aws:cloudwatch:us-east-1:885364800016:alarm:auth - 5xx Errors detected",
                            ]
                          + title  = ""
                        }
                      + type       = "alarm"
                      + width      = 24
                      + x          = 0
                      + y          = 13
                    },
                ]
            }
        )
      + dashboard_name = "wavelo_status"
      + id             = (known after apply)
    }

  # aws_secretsmanager_secret.slack_webhook will be created
  + resource "aws_secretsmanager_secret" "slack_webhook" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack_webhook"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
    }

  # module.cloudwatch_alerts.aws_kms_ciphertext.slack_url will be created
  + resource "aws_kms_ciphertext" "slack_url" {
      + ciphertext_blob = (known after apply)
      + id              = (known after apply)
      + key_id          = (known after apply)
      + plaintext       = (sensitive value)
    }

  # module.cloudwatch_alerts.aws_kms_key.slack_url will be created
  + resource "aws_kms_key" "slack_url" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for notify-slack"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
    }

  # module.cloudwatch_alerts.aws_sns_topic.slack will be created
  + resource "aws_sns_topic" "slack" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "slack_sns"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CreatedBy" = "kkeenan@tucowsinc.com"
          + "Owner"     = "platforms"
        }
      + tags_all                    = {
          + "CostCenter" = "Product Commercialization"
          + "CreatedBy"  = "kkeenan@tucowsinc.com"
          + "Layer"      = "3_containers"
          + "Owner"      = "platforms"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + tracing_config              = (known after apply)
    }

  # module.ecs_access_agreement_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-20230719184841736800000011/a5fa9d2d055f78c0"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "access-agreement-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/access-agreement/9104c02887a45678"
          + "TargetGroup"  = "targetgroup/tf-20230719184841736800000011/a5fa9d2d055f78c0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_access_agreement_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "access-agreement-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/access-agreement/9104c02887a45678"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_access_agreement_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-20230719184841736800000011/a5fa9d2d055f78c0"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "access-agreement-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/access-agreement/9104c02887a45678"
          + "TargetGroup"  = "targetgroup/tf-20230719184841736800000011/a5fa9d2d055f78c0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_access_agreement_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-20230719184841736800000011/a5fa9d2d055f78c0"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "access-agreement-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/access-agreement/9104c02887a45678"
          + "TargetGroup"  = "targetgroup/tf-20230719184841736800000011/a5fa9d2d055f78c0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_access_agreement_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "access-agreement-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "access-agreement"
          + "ServiceName" = "access-agreement"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_access_agreement_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "access-agreement-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "access-agreement"
          + "ServiceName" = "access-agreement"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_admin_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-20230719184828463800000009/f0b6bd613ab56e76"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "admin-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/admin/349bb7286b13af5e"
          + "TargetGroup"  = "targetgroup/tf-20230719184828463800000009/f0b6bd613ab56e76"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_admin_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "admin-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/admin/349bb7286b13af5e"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_admin_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-20230719184828463800000009/f0b6bd613ab56e76"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "admin-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/admin/349bb7286b13af5e"
          + "TargetGroup"  = "targetgroup/tf-20230719184828463800000009/f0b6bd613ab56e76"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_admin_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-20230719184828463800000009/f0b6bd613ab56e76"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "admin-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/admin/349bb7286b13af5e"
          + "TargetGroup"  = "targetgroup/tf-20230719184828463800000009/f0b6bd613ab56e76"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_admin_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "admin-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "admin"
          + "ServiceName" = "admin"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_admin_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "admin-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "admin"
          + "ServiceName" = "admin"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_auth_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-2023071918483668310000000e/73ed304f6da50cbe"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "auth-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/auth/66e9f5efad0f2e17"
          + "TargetGroup"  = "targetgroup/tf-2023071918483668310000000e/73ed304f6da50cbe"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_auth_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "auth-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/auth/66e9f5efad0f2e17"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_auth_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-2023071918483668310000000e/73ed304f6da50cbe"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "auth-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/auth/66e9f5efad0f2e17"
          + "TargetGroup"  = "targetgroup/tf-2023071918483668310000000e/73ed304f6da50cbe"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_auth_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-2023071918483668310000000e/73ed304f6da50cbe"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "auth-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/auth/66e9f5efad0f2e17"
          + "TargetGroup"  = "targetgroup/tf-2023071918483668310000000e/73ed304f6da50cbe"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_email_management_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-20230719184827206500000005/1cfc954cd65fd908"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "email-management-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/email-management/cb49d1a5c9cee507"
          + "TargetGroup"  = "targetgroup/tf-20230719184827206500000005/1cfc954cd65fd908"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_email_management_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "email-management-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/email-management/cb49d1a5c9cee507"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_email_management_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-20230719184827206500000005/1cfc954cd65fd908"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "email-management-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/email-management/cb49d1a5c9cee507"
          + "TargetGroup"  = "targetgroup/tf-20230719184827206500000005/1cfc954cd65fd908"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_email_management_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-20230719184827206500000005/1cfc954cd65fd908"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "email-management-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/email-management/cb49d1a5c9cee507"
          + "TargetGroup"  = "targetgroup/tf-20230719184827206500000005/1cfc954cd65fd908"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_email_management_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "email-management-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "email-management"
          + "ServiceName" = "email-management"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_email_management_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "email-management-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "email-management"
          + "ServiceName" = "email-management"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_emailer_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-20230719184825643200000003/0f3584e52bdd388b"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "emailer-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/emailer/b9ed0e1134722282"
          + "TargetGroup"  = "targetgroup/tf-20230719184825643200000003/0f3584e52bdd388b"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_emailer_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "emailer-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/emailer/b9ed0e1134722282"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_emailer_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-20230719184825643200000003/0f3584e52bdd388b"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "emailer-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/emailer/b9ed0e1134722282"
          + "TargetGroup"  = "targetgroup/tf-20230719184825643200000003/0f3584e52bdd388b"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_emailer_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-20230719184825643200000003/0f3584e52bdd388b"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "emailer-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/emailer/b9ed0e1134722282"
          + "TargetGroup"  = "targetgroup/tf-20230719184825643200000003/0f3584e52bdd388b"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_emailer_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "emailer-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "emailer"
          + "ServiceName" = "emailer"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_emailer_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "emailer-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "emailer"
          + "ServiceName" = "emailer"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_middleware_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-20230719184827287500000006/3e31e34c29c99041"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "middleware-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/middleware/8dd43e2a852c1de4"
          + "TargetGroup"  = "targetgroup/tf-20230719184827287500000006/3e31e34c29c99041"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_middleware_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "middleware-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/middleware/8dd43e2a852c1de4"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_middleware_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-20230719184827287500000006/3e31e34c29c99041"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "middleware-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/middleware/8dd43e2a852c1de4"
          + "TargetGroup"  = "targetgroup/tf-20230719184827287500000006/3e31e34c29c99041"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_middleware_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-20230719184827287500000006/3e31e34c29c99041"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "middleware-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/middleware/8dd43e2a852c1de4"
          + "TargetGroup"  = "targetgroup/tf-20230719184827287500000006/3e31e34c29c99041"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_middleware_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "middleware-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "middleware"
          + "ServiceName" = "middleware"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_middleware_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "middleware-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "middleware"
          + "ServiceName" = "middleware"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_man_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-20230719184825657800000004/aea63d8a46c4f042"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "order-management-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/order-management/23ea494838bf8c0a"
          + "TargetGroup"  = "targetgroup/tf-20230719184825657800000004/aea63d8a46c4f042"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_man_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "order-management-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/order-management/23ea494838bf8c0a"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_man_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-20230719184825657800000004/aea63d8a46c4f042"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "order-management-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/order-management/23ea494838bf8c0a"
          + "TargetGroup"  = "targetgroup/tf-20230719184825657800000004/aea63d8a46c4f042"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_man_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-20230719184825657800000004/aea63d8a46c4f042"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "order-management-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/order-management/23ea494838bf8c0a"
          + "TargetGroup"  = "targetgroup/tf-20230719184825657800000004/aea63d8a46c4f042"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_man_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "order-management-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "order-management"
          + "ServiceName" = "order-management"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_man_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "order-management-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "order-management"
          + "ServiceName" = "order-management"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_product_enrich_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-20230721152641069400000001/ad11c6296b6f1161"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "order-product-enrichment-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/order-product-enrichment/01e8307720d641ba"
          + "TargetGroup"  = "targetgroup/tf-20230721152641069400000001/ad11c6296b6f1161"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_product_enrich_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "order-product-enrichment-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/order-product-enrichment/01e8307720d641ba"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_product_enrich_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-20230721152641069400000001/ad11c6296b6f1161"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "order-product-enrichment-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/order-product-enrichment/01e8307720d641ba"
          + "TargetGroup"  = "targetgroup/tf-20230721152641069400000001/ad11c6296b6f1161"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_product_enrich_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-20230721152641069400000001/ad11c6296b6f1161"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "order-product-enrichment-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/order-product-enrichment/01e8307720d641ba"
          + "TargetGroup"  = "targetgroup/tf-20230721152641069400000001/ad11c6296b6f1161"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_product_enrich_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "order-product-enrichment-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "order-product-enrichment"
          + "ServiceName" = "order-product-enrichment"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_order_product_enrich_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "order-product-enrichment-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "order-product-enrichment"
          + "ServiceName" = "order-product-enrichment"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_platypus_driver_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-20230720145807166200000001/1cc8acd71966081b"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "platypus-driver-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/platypus-driver/410e775a5862a9eb"
          + "TargetGroup"  = "targetgroup/tf-20230720145807166200000001/1cc8acd71966081b"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_platypus_driver_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "platypus-driver-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/platypus-driver/410e775a5862a9eb"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_platypus_driver_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-20230720145807166200000001/1cc8acd71966081b"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "platypus-driver-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/platypus-driver/410e775a5862a9eb"
          + "TargetGroup"  = "targetgroup/tf-20230720145807166200000001/1cc8acd71966081b"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_platypus_driver_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-20230720145807166200000001/1cc8acd71966081b"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "platypus-driver-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/platypus-driver/410e775a5862a9eb"
          + "TargetGroup"  = "targetgroup/tf-20230720145807166200000001/1cc8acd71966081b"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_playtpus_driver_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "platypus-driver-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "platypus-driver"
          + "ServiceName" = "platypus-driver"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_playtpus_driver_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "platypus-driver-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "platypus-driver"
          + "ServiceName" = "platypus-driver"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_xperience_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.health_check_dns["targetgroup/tf-20230719184825642400000002/060a142d6a1254f1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "health_check_dns" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Health Checks failed on the Target Group"
      + alarm_name                            = "xperience-vq_stg_ue1 - Target Group Health Check Critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/xperience/a6b3c1ee1dd61e12"
          + "TargetGroup"  = "targetgroup/tf-20230719184825642400000002/060a142d6a1254f1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HealthyStateDNS"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_xperience_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.httpcode_lb_5xx_count will be created
  + resource "aws_cloudwatch_metric_alarm" "httpcode_lb_5xx_count" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API 5XX load balancer error code count is too high"
      + alarm_name                            = "xperience-vq_stg_ue1 - 5xx Errors detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/xperience/a6b3c1ee1dd61e12"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_ELB_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_xperience_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.target_response_time_average["targetgroup/tf-20230719184825642400000002/060a142d6a1254f1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average API response time is greater than 50"
      + alarm_name                            = "xperience-vq_stg_ue1 - High response time detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/xperience/a6b3c1ee1dd61e12"
          + "TargetGroup"  = "targetgroup/tf-20230719184825642400000002/060a142d6a1254f1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_xperience_cloudwatch_alerts_alb[0].aws_cloudwatch_metric_alarm.unhealthy_hosts["targetgroup/tf-20230719184825642400000002/060a142d6a1254f1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy host count is greater than 0"
      + alarm_name                            = "xperience-vq_stg_ue1 - Unhealthy Hosts in Target Group"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "LoadBalancer" = "app/xperience/a6b3c1ee1dd61e12"
          + "TargetGroup"  = "targetgroup/tf-20230719184825642400000002/060a142d6a1254f1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_xperience_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "xperience-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "xperience"
          + "ServiceName" = "xperience"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecs_xperience_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "xperience-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "xperience"
          + "ServiceName" = "xperience"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.esc_auth_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_cpu_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS CPU Usage is above threshold"
      + alarm_name                            = "auth-vq_stg_ue1 - ECS CPU Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "auth"
          + "ServiceName" = "auth"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.esc_auth_cloudwatch_alerts_ecs[0].aws_cloudwatch_metric_alarm.ecs_ram_usage will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_ram_usage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "ECS RAM Usage is above threshold"
      + alarm_name                            = "auth-vq_stg_ue1 - ECS RAM Usage High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "ClusterName" = "auth"
          + "ServiceName" = "auth"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.cloudwatch_alerts.module.notify_slack.data.aws_iam_policy_document.lambda[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/notify_slack"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
    }

  # module.cloudwatch_alerts.module.notify_slack.aws_sns_topic.this[0] will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "slack_sns"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + tracing_config              = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.data.aws_cloudwatch_log_group.lambda[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + creation_time     = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + name              = "/aws/lambda/notify_slack"
      + retention_in_days = (known after apply)
      + tags              = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/cloudwatch_alerts.notify_slack.lambda/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = ""
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/home/rdhar/code/wavelo-platforms-automation/terraform/stacks/3_containers"
                  + module = ".terraform/modules/cloudwatch_alerts.notify_slack.lambda"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = "python3.8"
          + "source_path"              = "\"./../../modules/cloudwatch/lambda/notify_slack.py\""
        }
      + result  = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.aws_iam_policy.additional_json[0] will be created
  + resource "aws_iam_policy" "additional_json" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "lambda-notify_slack"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-notify_slack"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + unique_id             = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.aws_iam_role_policy_attachment.additional_json[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_json" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda-notify_slack"
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = (known after apply)
      + function_name                  = "notify_slack"
      + handler                        = "notify_slack.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCenter" = "Product Commercialization"
          + "Layer"      = "3_containers"
          + "Repository" = "tucowsinc/wavelo-platforms-automation"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify_slack"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify_slack"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.cloudwatch_alerts.module.notify_slack.module.lambda.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = (known after apply)
          + "timestamp" = (known after apply)
        }
    }

Plan: 76 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...